;; -*- no-byte-compile: t; -*-
;;; emacs/dired/packages.el

(package! dired-k)
(package! stripe-buffer)
(package! dired+ :recipe (:fetcher github :repo "emacsmirror/dired-plus"))
(package! all-the-icons-dired)
(package! dired-sidebar)
(package! dired-quick-sort)
(package! peep-dired)
(package! dired-hacks-utils)
